{"format": "graph-model", "generatedBy": "2.20.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_learner_891": {"name": "input_learner_891:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "5"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/SingleLearner_891_1/dense_from_para_dense_learner_891_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SingleLearner_891_1/dense_from_para_dense_learner_891_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SingleLearner_891_1/dense_from_para_dense_1_learner_891_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SingleLearner_891_1/dense_from_para_dense_1_learner_891_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SingleLearner_891_1/dense_from_para_dense_2_learner_891_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SingleLearner_891_1/dense_from_para_dense_2_learner_891_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_learner_891", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "5"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SingleLearner_891_1/dense_from_para_dense_learner_891_1/Relu", "op": "_FusedMatMul", "input": ["input_learner_891", "StatefulPartitionedCall/SingleLearner_891_1/dense_from_para_dense_learner_891_1/Cast/ReadVariableOp", "StatefulPartitionedCall/SingleLearner_891_1/dense_from_para_dense_learner_891_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SingleLearner_891_1/dense_from_para_dense_1_learner_891_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/SingleLearner_891_1/dense_from_para_dense_learner_891_1/Relu", "StatefulPartitionedCall/SingleLearner_891_1/dense_from_para_dense_1_learner_891_1/Cast/ReadVariableOp", "StatefulPartitionedCall/SingleLearner_891_1/dense_from_para_dense_1_learner_891_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SingleLearner_891_1/dense_from_para_dense_2_learner_891_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/SingleLearner_891_1/dense_from_para_dense_1_learner_891_1/Relu", "StatefulPartitionedCall/SingleLearner_891_1/dense_from_para_dense_2_learner_891_1/Cast/ReadVariableOp", "StatefulPartitionedCall/SingleLearner_891_1/dense_from_para_dense_2_learner_891_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/SingleLearner_891_1/dense_from_para_dense_2_learner_891_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/SingleLearner_891_1/dense_from_para_dense_learner_891_1/Cast/ReadVariableOp", "shape": [5, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SingleLearner_891_1/dense_from_para_dense_learner_891_1/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SingleLearner_891_1/dense_from_para_dense_1_learner_891_1/Cast/ReadVariableOp", "shape": [16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SingleLearner_891_1/dense_from_para_dense_1_learner_891_1/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SingleLearner_891_1/dense_from_para_dense_2_learner_891_1/Cast/ReadVariableOp", "shape": [16, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/SingleLearner_891_1/dense_from_para_dense_2_learner_891_1/Add/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}